{
	"@metadata": {
		"authors": [
			"Dr Lotus Black",
			"Phosai"
		]
	},
	"svgtranslate": "SVG ဘာသာပြန်ဆိုခြင်း",
	"info": "SVG ဖိုင်များတွင်ပါဝင်သည့် စာသားအညွှန်းများကို ဘာသာပြန်ရာတွင် ကူညီပေးပါ။ ဘာသာပြန်ဆိုမှုစတင်ရန် ကွန်မွန်းစ်တွင် ဖိုင်တစ်ခုကို ရွေးချယ်ပါ။",
	"learn-more": "ပိုမိုလေ့လာရန်။",
	"return-to-home": "မူလနေရာသို့ ပြန်သွားမည်",
	"help": "အ​ကူ​အ​ညီ​",
	"login": "အကောင့်ဝင်ရန်",
	"logout": "အကောင့်ထွက်ရန်",
	"logged-in-as": "$1 အဖြစ် လော့ဂ်အင်ဝင်ခဲ့သည်",
	"language-settings": "ဘာသာစကား အပြင်အဆင်များ",
	"done": "ပြီးပြီ",
	"cancel": "မလုပ်တော့ပါ",
	"interface-lang-field-label": "ကိရိယာ၏ ဘာသာစကား:",
	"interface-lang-field-help": "ကိရိယာအား ဤဘာသာစကားဖြင့် ပြသမည်။",
	"preferred-langs-field-label": "၎င်း သို့/မှ ဘာသာပြန်ဆိုရန် နှစ်သက်သော ဘာသာစကားများ:",
	"preferred-langs-field-help": "ဘာသာပြန်ဆိုသည့် စာမျက်နှာတွင် ၎င်းတို့ကြားမှ သင်ပြောင်းသည့်အခါ ဤဘာသာစကားများကို စာမျက်နှာ၏ ထိပ်နားတွင် ပြသထားသည်။",
	"add-preferred-lang": "ပေါင်းထည့်ရန်",
	"search-help": "ကွန်မွန်းစ် မှ ဖိုင်အမည်ကို ရိုက်ထည့်ရန်",
	"search-label": "ဖိုင်အမည် ('ဖိုင်:' ရှေ့ဆက်စာလုံးမပါဘဲ) သို့မဟုတ် URL:",
	"search-placeholder": "100 Years War France 1435.svg",
	"translate-button": "ဘာသာပြန်ဆိုရန်",
	"no-translations": "ဤဖိုင်တွင် ဘာသာပြန်ဆိုရန် စာသားအညွှန်းများ မရှိပါ။ ကျေးဇူးပြု၍ အခြားပုံကို ရွေးပါ။",
	"not-found": "သင်တောင်းဆိုထားသည့် ဖိုင်ကို ရှာမတွေ့ပါ။ ကျေးဇူးပြု၍ အခြားပုံကို ရွေးပါ။",
	"invalid-format": "SVG ဖိုင်များကိုသာ ပံ့ပိုးပေးသည်။",
	"invalid-svg": "ဖိုင်ကို ဖတ်ရာတွင် အမှားအယွင်းရှိသည်။",
	"network-error": "ဝီကီမီဒီယာ ဆာဗာများမှ အချက်အလက်ရယူရာ၌ အမှားအယွင်းရှိနေသည်။ နောက်မှ ထပ်မံကြိုးစားကြည့်ပါ။",
	"structure-error-no-doc-element": "စာရွက်စာတမ်း အစိတ်အပိုင်းအား ရှာမတွေ့ပါ။",
	"structure-error-nested-tspans-not-supported": "ဤဖိုင်သည် $1 တွင် nested tspan အစိတ်အပိုင်းများ ပါ၀င်သည့်အတွက်ကြောင့် ဘာသာပြန်ဆို၍မရနိုင်ပါ။",
	"structure-error-multiple-text-same-lang": "ဘာသာစကားကုဒ် '$2' (အိုင်ဒီ '$1' ဖြင့် အစိတ်အပိုင်းတွင်) ဖြင့် စာသားအစိတ်အပိုင်းများစွာ တွေ့ရှိထားသည်။",
	"structure-error-contains-tref": "ဤဖိုင်တွင် ဤကိရိယာမှ ပံ့ပိုးပေးထားခြင်းမရှိသော tref စာတွဲများပါရှိနေသည်။",
	"structure-error-css-too-complex": "ဤဖိုင်တွင် ခွဲခြမ်းစိတ်ဖြာရန် အလွန်ရှုပ်ထွေးသော CSS ပါရှိနေသည်။",
	"structure-error-css-has-ids": "SVG ဘာသာပြန်ဆိုမှု ID အသစ်များထည့်သည့်အခါ ဤဖိုင်သည် CSS တွင် အစိတ်အပိုင်း အိုင်ဒီများကို အသုံးပြုသည်။ ဖြစ်နိုင်လျှင် အဆင့် အမျိုးအစားများကို သုံးသင့်သည်။",
	"structure-error-unexpected-node-in-text": "ဤဖိုင်၏ စာသားအစိတ်အပိုင်းတစ်ခုထဲတွင် မျှော်မှန်းမထားသော အကြောင်းအရာများ ပါဝင်နေသည်။ tspan အစိတ်အပိုင်းများကိုသာ စာသားအတွင်းတွင် အသုံးပြုသင့်သည်။",
	"structure-error-invalid-node-id": "ဤဖိုင်တွင် SVG ဘာသာပြန်ဆိုမှုဖြင့် ခွင့်ပြုမထားသည့် စာလုံးများပါရှိသော စာသားအစိတ်အပိုင်း အိုင်ဒီ ($1) ပါဝင်နေသည်။",
	"structure-error-text-contains-dollar": "ဤဖိုင်တွင် $1 ('$2') ထဲ၌ ပံ့ပိုးပေးမထားသော စာသားအကြောင်းအရာပါရှိသည်။ SVG ဘာသာပြန်ဆိုခြင်းသည် ဒေါ်လာဂဏန်း အထားအသိုနှင့် အလုပ်မလုပ်နိုင်ပါ။",
	"structure-error-non-tspan-inside-text": "ဤဖိုင်တွင် tspan အစိတ်အပိုင်းမဟုတ်သည့် အကြောင်းအရာပါရှိသော စာသားအစိတ်အပိုင်းတစ်ခုပါရှိနေသည်။",
	"structure-error-switch-text-is-not-node": "ဤဖိုင်တွင် switch အစိတ်အပိုင်းတစ်ခုအတွင်း node မဟုတ်သော အကြောင်းအရာများ ပါရှိနေသည်။",
	"structure-error-switch-text-content-outside-text": "ဤဖိုင်တွင် switch အစိတ်အပိုင်းတစ်ခုအတွင်း၌ စာသားအကြောင်းအရာပါရှိသော်လည်း စာသားစာတွဲတစ်ခု၏ အပြင်ဘက်၌ရှိနေပြီး SVG ဘာသာပြန်ဆိုမှုမှ ၎င်းအား ကိုင်တွယ်ဖြေရှင်းနိုင်မှုမရှိပါ။",
	"structure-error-switch-child-not-text": "ဤဖိုင်တွင် စာသားအစိတ်အပိုင်းမဟုတ်သော အစိတ်အပိုင်းတစ်ခုပါ၀င်သည့် switch အစိတ်အပိုင်းတစ်ခုပါရှိနေသည်။",
	"structure-error-multiple-lang-in-text": "ဤဖိုင်တွင် systemLanguage attributes တွင် ထပ်ခါတလဲလဲထည့်သွင်းသော ဘာသာစကားကုဒ် '$2' ပါရှိသည့် စာသားအစိတ်အပိုင်းများပါရှိသည်။",
	"structure-error-no-id": "[အစိတ်အပိုင်း အိုင်ဒီကို သတ်မှတ်နိုင်သည်]",
	"pick-another": "← အခြားဖိုင်ကို ရွေးပါ",
	"view-on-commons": "ကွန်မွန်းစ်ပေါ်တွင် ကြည့်ရှုရန်",
	"opens-in-new-tab": "tab အသစ်တွင် ဖွင့်ရန်",
	"default-language": "ပင်မ ဘာသာစကား",
	"source-lang-not-found": "ဘာသာပြန်မထားသော။ မူရင်း: $1",
	"source-to-target": "သို့",
	"select-language": "ဘာသာစကားတစ်ခု ရွေးရန်",
	"confirmation-to-switch-target-lang": "သင်သည် ဘာသာပြန်ဆိုခြင်းအတွက် ဘာသာစကားကို ပြောင်းလဲရန် ကြိုးစားနေသော်လည်း သင့်တွင် မသိမ်းဆည်းရသေးသော ဘာသာပြန်ဆိုမှုများ ရှိနေပါသည်။ ဘာသာစကားကို ပြောင်းလဲခြင်းဖြင့် ထပ်လောင်းဘာသာပြန်ဆိုမှုများ ဆုံးရှုံးသွားမည်ဖြစ်သည်။ ဆက်လက်မလုပ်ဆောင်မီ ဘာသာပြန်ဆိုချက်များကို ကွန်မွန်းစ် သို့ အပ်လုဒ်လုပ်ပါ သို့မဟုတ် ဘာသာပြန်ထားသော ဖိုင်ကို ဒေါင်းလုဒ်လုပ်ပါ။ သင် ဆက်လက်လုပ်ဆောင်ရန် ဆန္ဒရှိပါသလား?",
	"confirm-change-target-lang": "ဘာသာစကား ပြောင်းလဲရန်",
	"upload-button-label": "ကွန်မွန်းစ်သို့ အက်ပလုဒ်တင်ရန်",
	"upload-button-in-progress": "ကွန်မွန်းစ်သို့ အက်ပလုဒ်တင်နေသည်...",
	"upload-login-warning": "အက်ပလုဒ်တင်ခွင့် ရရှိရန် လော့ဂ်အင်ဝင်ပါ",
	"download-button-label": "ဒေါင်းလုဒ်",
	"download-or-upload": "သို့မဟုတ်",
	"translation-image-alt": "ဤသည်မှာ လက်ရှိ ဘာသာပြန်နေသော ပုံ ဖြစ်သည်။ ဖော်ပြချက် မရရှိနိုင်ပါ။",
	"preview-error-occurred": "အစမ်းကြည့်ရှုမှုကို ရယူရာတွင် အမှားအယွင်းတစ်ခု ဖြစ်ပေါ်ခဲ့သည်။ ကျေးဇူးပြု၍ ဆက်ပြီး ဘာသာပြန်ပါ၊ သို့သော် ဤအမှားအယွင်း ဆက်လက်ရှိနေသေးပါက ချို့ယွင်းချက်အား သတင်းပို့ပါ (အောက်ပါ အောက်ခြေရှိ လင့်ခ်မှတစ်ဆင့်)။",
	"download-icon-alt": "ဖိုင်-ဒေါင်းလုဒ်ကို ညွှန်ပြသော အိုင်ကွန်သင်္ကေတ",
	"pick-an-image-title": "ပုံတစ်ပုံ ရွေးပါ",
	"pick-an-image-desc": "ကွန်မွန်းစ် မှ။",
	"translate-icon-alt": "ဘာသာစကားများစွာကို ညွှန်ပြသည့် အိုင်ကွန်သင်္ကေတတစ်ခု",
	"translate-labels-title": "ဘာသာပြန်ဆိုရန်",
	"translate-labels-desc": "ပုံအတွင်းမှ စာသားတံဆိပ်များ။",
	"commons-logo-alt": "ဝီကီမီဒီယာ ကွန်မွန်းစ် လိုဂိုအမှတ်တံဆိပ်",
	"update-commons-title": "ကွန်မွန်းစ်အား အပ်ဒိတ်လုပ်ရန်",
	"update-commons-desc": "သို့မဟုတ် သင့်ကွန်ပျူတာသို့ တိုက်ရိုက်ဒေါင်းလုဒ်လုပ်ပါ။",
	"upload-complete": "အပ်လုဒ် ပြီးပါပြီ",
	"upload-complete-message": "ကျေးဇူးတင်ပါတယ်! သင့်ဘာသာပြန်ဆိုချက်များအား $1 သို့ အပ်လုဒ်လုပ်ပြီးဖြစ်ပါသည်။ အညွှန်းများကို ဆက်လက်ဘာသာပြန်ပြီး ပုံအား မွမ်းမံ၍ ထပ်မံ အပ်လုဒ်လုပ်နိုင်ပါသည်။",
	"upload-complete-commons": "ပုံကို ကြည့်ရန်",
	"upload-complete-translate-another": "အခြားပုံကို ဘာသာပြန်ဆိုရန်",
	"licenced-under": "GPL 3.0 သို့မဟုတ် ၎င်းနောက်ပိုင်း လိုင်စင်အောက်တွင် သတ်မှတ်ထားသည်",
	"developed-by": "ဝီကီမီဒီယာ ဖောင်ဒေးရှင်း၏ ကွန်မြူနီတီ နည်းပညာအဖွဲ့မှ တီထွင်ဖန်တီးထားသည်",
	"version": "ဗားရှင်း $1",
	"git-hash": "လက်ရှိ၌ commit $1 တွင်",
	"toolforge-logo-alt": "Toolforge 'anvil' လိုဂိုအမှတ်တံဆိပ်",
	"powered-by-toolforge": "Toolforge မှ အားဖြည့်ပေးထားသည်",
	"privacy-policy": "ကိုယ်ရေးကိုယ်တာ မူဝါဒ",
	"report-issue": "အခက်အခဲများ သတင်းပို့ရန်",
	"view-source": "Github တွင် ကြည့်ရှုရန်",
	"translatewiki": "ဤကိရိယာကို Translatewiki တွင် ဘာသာပြန်ရန် ကူညီပါ"
}
