{
  "svgtranslate": "The title of the application.",
  "info": "Sentences describing what this tool does and how to get started.",
  "beta": "Message informing the user that the application is currently of beta quality.",
  "learn-more": "Text for a link to the on-wiki project page for the tool (the same destination as the link of {{msg-mw|help}}).",

  "help": "Text for a 'help' link to the tool's project page on Meta (the same destination as the link of {{msg-mw|learn-more}}). Displayed in the footer on every page.",
  "login": "Label for the 'log in' link. Displayed in the header on every page when not logged in.",
  "logout": "Label for the 'log out' link. Displayed in the header on every page when logged in.",
  "logged-in-as": "Text indicating that the user is logged in. $1 is the username of the current user.",

  "language-settings": "Label for link that opens the language settings dialog.",
  "done": "Label for the button in the language settings dialog that saves the changes and closes the dialog.",
  "cancel": "Label for the button in the language settings dialog that closes the dialog (without saving any changes).",
  "interface-lang-field-label": "Label for the settings field for the interface language of the application.",
  "interface-lang-field-help": "Help text for the settings field for the interface language of the application. Shown near {{msg-wm|interface-lang-field-label}}",
  "preferred-langs-field-label": "Label for the settings field for the list of preferred translation languages.",
  "preferred-langs-field-help": "Help text for the settings field for the list of preferred translation languages. Shown near {{msg-wm|preferred-langs-field-label}}",
  "add-preferred-lang": "Label for the button that opens a popup for selecting a new language to add to the list of preferred languages.",

  "search-help": "Help text for the search box.",
  "search-label": "Label for the search box.",
  "search-placeholder": "An example filename visible in the search box. Doesn't have to exist on Commons.",
  "translate-button": "Search button text.",

  "pick-another": "Label for backlink from the translate page to the search page.",
  "view-on-commons": "Link to view the file on Commons. The whole phrase is linked.",
  "opens-in-new-tab": "Tooltip text for links that will open in a new browser tab.",
  "default-language": "Label at the top of the source-language dropdown list indicating that the SVG file's default language will be used (we don't know what the specific language is).",
  "source-lang-not-found": "Label shown when the selected source-language is not available. $1 is the label in the default language (we don't know what the specific language is).",
  "source-to-target": "Joining label between the source-language selector and the target language selector.",
  "confirmation-to-switch-target-lang": "Confirmation message shown when a user tries to switch the target language but has unsaved changes in the form.",
  "confirm-change-target-lang": "Label for the confirm button for {{msg-wm|confirmation-to-switch-target-lang}}, to appear next to 'Cancel' (i.e. {{wm-msg|ooui-dialog-message-reject}}).",
  "upload-button-label": "Label for the button that uploads the translated SVG to Wikimedia Commons.",
  "upload-button-in-progress": "Label that the upload button swiches to after it's been clicked, while the file is uploading. The button is also disabled at this point.",
  "download-button-label": "Label for the button that downloads the translated SVG to the user's local computer.",
  "download-or-upload": "Label positioned between the download and the upload buttons.",
  "translation-image-alt": "Alt text for the image that's currently being translated. Doesn't explain the image, just explains that we don't explain it.",
  "preview-error-occurred": "Error message displayed in a popup when fetching a preview failed. The only option is 'OK' to close the popup.",

  "download-icon-alt": "Alt text for the download icon.",
  "pick-an-image-title": "The title of the 'pick an image' step of the tutorial box.",
  "pick-an-image-desc": "The short description of the 'pick an image' part of the tutorial box. May be a continuation of the phrase in {{msg-mw|pick-an-image-title}}.",
  "translate-icon-alt": "Alt text for the translate icon.",
  "translate-labels-title": "The title of the 'translate' step of the tutorial box.",
  "translate-labels-desc": "The short description of the 'translate' step of the tutorial box. May be a continuation of the phrase in {{msg-mw|translate-labels-title}}.",
  "commons-logo-alt": "Alt text for the Wikimedia Commons logo.",
  "update-commons-title": "The title of the 'update commons' step of the tutorial box.",
  "update-commons-desc": "The short description of the 'update commons' step of the tutorial box. May be a continuation of the phrase in {{msg-mw|update-commons-title}}.",

  "upload-complete": "Header text for the banner shown after successful upload of a file.",
  "upload-complete-message": "Text in the banner shown after successful upload of a file.\n$1 is the filename of the image (without link).",
  "upload-complete-commons": "First of two buttons shown in the successful-upload banner, linking to the newly-uploaded file on Commons.",
  "upload-complete-translate-another": "Second of two buttons shown in the successful-upload banner, linking back to the SVG Translate search form.",

  "licenced-under": "Sentence describing the licence of the application, shown as a link. Displayed in the footer on every page.",
  "developed-by": "By-line for the application, shown as a link to CommTech's wiki page. Displayed in the footer on every page.",
  "toolforge-logo-alt": "Alt text for the Toolforge anvil image.",
  "powered-by-toolforge": "Label for the link to the Toolforge homepage. Displayed in the footer on every page.",
  "privacy-policy": "Label for the link to the Wikimedia privacy policy. Displayed in the footer on every page.",
  "report-issue": "Label for issue-reporting link to Phabricator. Displayed in the footer on every page.",
  "view-source": "Label for the link to the Github project page. Displayed in the footer on every page."
}
